Учет_трудозатрат_EDT/src/Documents/ут_УстановкаНормыЧасовВМесяце/ут_УстановкаНормыЧасовВМесяце.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ут_УстановкаНормыЧасовВМесяце</name>
  <registerRecords>InformationRegister.ут_НормыЧасовВМесяцах</registerRecords>
  <tabularSections>
    <name>Нормы</name>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>CatalogRef.ут_Месяцы</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_трудозатрат_EDT/src/InformationRegisters/ут_НормыЧасовВМесяцах/ут_НормыЧасовВМесяцах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ут_НормыЧасовВМесяцах</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>CatalogRef.ут_Месяцы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_трудозатрат_EDT/src/Documents/ут_УстановкаНормыЧасовВМесяце/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ут_НормыЧасовВМесяцах
	Движения.ут_НормыЧасовВМесяцах.Записывать = Истина;
	Для Каждого ТекСтрокаНормы Из Нормы Цикл
		Движение = Движения.ут_НормыЧасовВМесяцах.Добавить();
		Движение.Период = Дата;
		Движение.Месяц = ТекСтрокаНормы.Месяц;
		Движение.Норма = ТекСтрокаНормы.Норма;
	КонецЦикла;

КонецПроцедуры
